In [7]:
import pandas as pd

In [45]:
data = {"name":["a","b","c","d","a","c"] ,"eng" : [8,4,8,7,8,9] ,"urdu":[2,3,4,2,2,7]}

In [47]:
df = pd.DataFrame(data)
df

  name  eng  urdu
0    a    8     2
1    b    4     3
2    c    8     4
3    d    7     2
4    a    8     2
5    c    9     7

In [49]:
# df['duplicated']=df.duplicated()
# df

In [57]:
df.drop_duplicates(inplace=True)
df

  name  eng  urdu
0    a    8     2
1    b    4     3
2    c    8     4
3    d    7     2
5    c    9     7